; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty-shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean-shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour-shot-to-clean-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))))
 )

; problem
(define (problem barman-3)
 (:domain barman)
 (:objects 
     shaker1 - shaker
     left right - hand
     shot1 shot2 shot3 shot4 shot5 shot6 shot7 shot8 shot9 shot10 - shot
     ingredient1 ingredient2 ingredient3 ingredient4 ingredient5 - ingredient
     cocktail1 cocktail2 cocktail3 cocktail4 cocktail5 - cocktail
     dispenser1 dispenser2 dispenser3 dispenser4 dispenser5 - dispenser
     l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (ontable shot6)
  (ontable shot7)
  (ontable shot8)
  (ontable shot9)
  (ontable shot10)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (dispenses dispenser3 ingredient3)
  (dispenses dispenser4 ingredient4)
  (dispenses dispenser5 ingredient5)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (clean shot6)
  (clean shot7)
  (clean shot8)
  (clean shot9)
  (clean shot10)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (empty shot6)
  (empty shot7)
  (empty shot8)
  (empty shot9)
  (empty shot10)
  (handempty left)
  (handempty right)
  (shaker-empty-level shaker1 l0)
  (shaker-level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail-part1 cocktail1 ingredient2)
  (cocktail-part2 cocktail1 ingredient4)
  (cocktail-part1 cocktail2 ingredient4)
  (cocktail-part2 cocktail2 ingredient1)
  (cocktail-part1 cocktail3 ingredient5)
  (cocktail-part2 cocktail3 ingredient3)
  (cocktail-part1 cocktail4 ingredient4)
  (cocktail-part2 cocktail4 ingredient3)
  (cocktail-part1 cocktail5 ingredient4)
  (cocktail-part2 cocktail5 ingredient1)
)
 (:goal
  (and
     (contains shot1 cocktail3)
     (contains shot2 cocktail4)
     (contains shot3 cocktail1)
     (contains shot4 cocktail2)
     (contains shot5 cocktail5)
     (contains shot6 cocktail4)
     (contains shot7 cocktail2)
     (contains shot8 cocktail2)
     (contains shot9 cocktail4)
)))

; plan
1. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 9
2. (grasp right shot9)
   deleted: (ontable shot9) (handempty right)
   added: (holding right shot9)
   goals met: 0 of 9
3. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 0 of 9
4. (fill-shot shot9 ingredient5 right left dispenser5)
   deleted: (empty shot9) (clean shot9)
   added: (contains shot9 ingredient5) (used shot9 ingredient5)
   goals met: 0 of 9
5. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 9
6. (pour-shot-to-clean-shaker shot9 ingredient5 shaker1 right l0 l1)
   deleted: (contains shot9 ingredient5) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot9) (contains shaker1 ingredient5) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 9
7. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 0 of 9
8. (clean-shot shot9 ingredient5 right left)
   deleted: (used shot9 ingredient5)
   added: (clean shot9)
   goals met: 0 of 9
9. (fill-shot shot9 ingredient3 right left dispenser3)
   deleted: (empty shot9) (clean shot9)
   added: (contains shot9 ingredient3) (used shot9 ingredient3)
   goals met: 0 of 9
10. (pour-shot-to-used-shaker shot9 ingredient3 shaker1 right l1 l2)
   deleted: (contains shot9 ingredient3) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient3) (empty shot9) (shaker-level shaker1 l2)
   goals met: 0 of 9
11. (clean-shot shot9 ingredient3 right left)
   deleted: (used shot9 ingredient3)
   added: (clean shot9)
   goals met: 0 of 9
12. (grasp left shot10)
   deleted: (ontable shot10) (handempty left)
   added: (holding left shot10)
   goals met: 0 of 9
13. (leave right shot9)
   deleted: (holding right shot9)
   added: (handempty right) (ontable shot9)
   goals met: 0 of 9
14. (fill-shot shot10 ingredient2 left right dispenser2)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient2) (used shot10 ingredient2)
   goals met: 0 of 9
15. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 0 of 9
16. (leave left shot10)
   deleted: (holding left shot10)
   added: (handempty left) (ontable shot10)
   goals met: 0 of 9
17. (shake cocktail3 ingredient5 ingredient3 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient5) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail3)
   goals met: 0 of 9
18. (pour-shaker-to-shot cocktail3 shot1 right shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker-level shaker1 l2)
   added: (contains shot1 cocktail3) (shaker-level shaker1 l1)
   goals met: 1 of 9
19. (empty-shaker right shaker1 cocktail3 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail3)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 1 of 9
20. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 1 of 9
21. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 1 of 9
22. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 1 of 9
23. (pour-shot-to-clean-shaker shot10 ingredient2 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient2) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient2) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 1 of 9
24. (clean-shot shot10 ingredient2 right left)
   deleted: (used shot10 ingredient2)
   added: (clean shot10)
   goals met: 1 of 9
25. (fill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient4) (used shot10 ingredient4)
   goals met: 1 of 9
26. (pour-shot-to-used-shaker shot10 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot10) (shaker-level shaker1 l2)
   goals met: 1 of 9
27. (refill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10)
   added: (contains shot10 ingredient4)
   goals met: 1 of 9
28. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 9
29. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 1 of 9
30. (shake cocktail1 ingredient2 ingredient4 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient4)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 1 of 9
31. (pour-shaker-to-shot cocktail1 shot3 left shaker1 l2 l1)
   deleted: (clean shot3) (empty shot3) (shaker-level shaker1 l2)
   added: (contains shot3 cocktail1) (shaker-level shaker1 l1)
   goals met: 2 of 9
32. (empty-shaker left shaker1 cocktail1 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail1)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 2 of 9
33. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 2 of 9
34. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 2 of 9
35. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 2 of 9
36. (pour-shot-to-clean-shaker shot10 ingredient4 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 2 of 9
37. (clean-shot shot10 ingredient4 right left)
   deleted: (used shot10 ingredient4)
   added: (clean shot10)
   goals met: 2 of 9
38. (fill-shot shot10 ingredient3 right left dispenser3)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient3) (used shot10 ingredient3)
   goals met: 2 of 9
39. (pour-shot-to-used-shaker shot10 ingredient3 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient3) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient3) (empty shot10) (shaker-level shaker1 l2)
   goals met: 2 of 9
40. (refill-shot shot10 ingredient3 right left dispenser3)
   deleted: (empty shot10)
   added: (contains shot10 ingredient3)
   goals met: 2 of 9
41. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 2 of 9
42. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 2 of 9
43. (shake cocktail4 ingredient4 ingredient3 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail4)
   goals met: 2 of 9
44. (pour-shaker-to-shot cocktail4 shot2 left shaker1 l2 l1)
   deleted: (clean shot2) (empty shot2) (shaker-level shaker1 l2)
   added: (contains shot2 cocktail4) (shaker-level shaker1 l1)
   goals met: 3 of 9
45. (pour-shaker-to-shot cocktail4 shot6 left shaker1 l1 l0)
   deleted: (clean shot6) (empty shot6) (shaker-level shaker1 l1)
   added: (contains shot6 cocktail4) (shaker-level shaker1 l0)
   goals met: 4 of 9
46. (empty-shaker left shaker1 cocktail4 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail4)
   added: (empty shaker1)
   goals met: 4 of 9
47. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 4 of 9
48. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 4 of 9
49. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 4 of 9
50. (pour-shot-to-clean-shaker shot10 ingredient3 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient3) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient3) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 4 of 9
51. (clean-shot shot10 ingredient3 right left)
   deleted: (used shot10 ingredient3)
   added: (clean shot10)
   goals met: 4 of 9
52. (fill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient4) (used shot10 ingredient4)
   goals met: 4 of 9
53. (pour-shot-to-used-shaker shot10 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot10) (shaker-level shaker1 l2)
   goals met: 4 of 9
54. (refill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10)
   added: (contains shot10 ingredient4)
   goals met: 4 of 9
55. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 4 of 9
56. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 4 of 9
57. (shake cocktail4 ingredient4 ingredient3 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail4)
   goals met: 4 of 9
58. (pour-shaker-to-shot cocktail4 shot9 left shaker1 l2 l1)
   deleted: (clean shot9) (empty shot9) (shaker-level shaker1 l2)
   added: (contains shot9 cocktail4) (shaker-level shaker1 l1)
   goals met: 5 of 9
59. (empty-shaker left shaker1 cocktail4 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail4)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 5 of 9
60. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 5 of 9
61. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 5 of 9
62. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 5 of 9
63. (pour-shot-to-clean-shaker shot10 ingredient4 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 5 of 9
64. (clean-shot shot10 ingredient4 right left)
   deleted: (used shot10 ingredient4)
   added: (clean shot10)
   goals met: 5 of 9
65. (fill-shot shot10 ingredient1 right left dispenser1)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient1) (used shot10 ingredient1)
   goals met: 5 of 9
66. (pour-shot-to-used-shaker shot10 ingredient1 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient1) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient1) (empty shot10) (shaker-level shaker1 l2)
   goals met: 5 of 9
67. (refill-shot shot10 ingredient1 right left dispenser1)
   deleted: (empty shot10)
   added: (contains shot10 ingredient1)
   goals met: 5 of 9
68. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 5 of 9
69. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 5 of 9
70. (shake cocktail5 ingredient4 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail5)
   goals met: 5 of 9
71. (pour-shaker-to-shot cocktail5 shot5 left shaker1 l2 l1)
   deleted: (clean shot5) (empty shot5) (shaker-level shaker1 l2)
   added: (contains shot5 cocktail5) (shaker-level shaker1 l1)
   goals met: 6 of 9
72. (empty-shaker left shaker1 cocktail5 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail5)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 6 of 9
73. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 6 of 9
74. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 6 of 9
75. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 6 of 9
76. (pour-shot-to-clean-shaker shot10 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 6 of 9
77. (clean-shot shot10 ingredient1 right left)
   deleted: (used shot10 ingredient1)
   added: (clean shot10)
   goals met: 6 of 9
78. (fill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient4) (used shot10 ingredient4)
   goals met: 6 of 9
79. (pour-shot-to-used-shaker shot10 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot10) (shaker-level shaker1 l2)
   goals met: 6 of 9
80. (refill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10)
   added: (contains shot10 ingredient4)
   goals met: 6 of 9
81. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 6 of 9
82. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 6 of 9
83. (shake cocktail2 ingredient4 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 6 of 9
84. (pour-shaker-to-shot cocktail2 shot4 left shaker1 l2 l1)
   deleted: (clean shot4) (empty shot4) (shaker-level shaker1 l2)
   added: (contains shot4 cocktail2) (shaker-level shaker1 l1)
   goals met: 7 of 9
85. (pour-shaker-to-shot cocktail2 shot7 left shaker1 l1 l0)
   deleted: (clean shot7) (empty shot7) (shaker-level shaker1 l1)
   added: (contains shot7 cocktail2) (shaker-level shaker1 l0)
   goals met: 8 of 9
86. (empty-shaker left shaker1 cocktail2 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail2)
   added: (empty shaker1)
   goals met: 8 of 9
87. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 8 of 9
88. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 8 of 9
89. (pour-shot-to-clean-shaker shot10 ingredient4 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 8 of 9
90. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 8 of 9
91. (clean-shot shot10 ingredient4 right left)
   deleted: (used shot10 ingredient4)
   added: (clean shot10)
   goals met: 8 of 9
92. (fill-shot shot10 ingredient1 right left dispenser1)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient1) (used shot10 ingredient1)
   goals met: 8 of 9
93. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 8 of 9
94. (pour-shot-to-used-shaker shot10 ingredient1 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient1) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient1) (empty shot10) (shaker-level shaker1 l2)
   goals met: 8 of 9
95. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 8 of 9
96. (shake cocktail2 ingredient4 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 8 of 9
97. (pour-shaker-to-shot cocktail2 shot8 left shaker1 l2 l1)
   deleted: (clean shot8) (empty shot8) (shaker-level shaker1 l2)
   added: (contains shot8 cocktail2) (shaker-level shaker1 l1)
   goals met: 9 of 9
